archive/before-2018-11-10/source/2018-01-15-linux内核中的数据结构.org
#+AUTHOR: Peng Xie
#+EMAIL: pengpengxpplay@gmail.com
#+SETUPFILE: theme.setup
#+OPTIONS: ^:{}
#+TITLE: linux内核中的数据结构

最近项目中需要使用链表，我们直接就把kernel中的链表拿来使用了。

为了方便复用，内核把一些常用的数据结构都提取出来了。可以参考
[[https://notes.shichao.io/lkd/ch6/][Chapter 6. Kernel Data Structures - Shichao's Notes]] 。主要就是下面几种：
 
+ Linked lists
+ Queues
+ Maps
+ Binary trees

* Linked lists
