archive/before-2018-11-10/2018-01-15-linux内核中的数据结构.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux内核中的数据结构</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">linux内核中的数据结构</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6fba906">1. Linked lists</a>
<ul>
<li><a href="#org932cab4">1.1. list.h</a></li>
<li><a href="#org3403d27">1.2. main</a></li>
<li><a href="#org026d702">1.3. Makefile</a></li>
<li><a href="#orgb6ee252">1.4. more example</a></li>
</ul>
</li>
<li><a href="#orge7004f0">2. <span class="todo TODO">TODO</span> Queues</a></li>
<li><a href="#org57eb882">3. <span class="todo TODO">TODO</span> Maps</a></li>
<li><a href="#org719db3c">4. <span class="todo TODO">TODO</span> Binary trees</a></li>
</ul>
</div>
</div>
<p>
最近项目中需要使用链表，我们直接就把kernel中的链表拿来使用了。
</p>

<p>
为了方便复用，内核把一些常用的数据结构都提取出来了。可以参考
<a href="https://notes.shichao.io/lkd/ch6/">Chapter 6. Kernel Data Structures - Shichao's Notes</a> 。主要就是下面几种：
</p>

<ul class="org-ul">
<li>Linked lists</li>
<li>Queues</li>
<li>Maps</li>
<li>Binary trees</li>
</ul>
