archive/before-2018-11-10/2018-01-15-linux内核中的数据结构.html

<div id="outline-container-org6fba906" class="outline-2">
<h2 id="org6fba906"><span class="section-number-2">1</span> Linked lists</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org932cab4" class="outline-3">
<h3 id="org932cab4"><span class="section-number-3">1.1</span> list.h</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * Copyright (C) 2017 Bei Jing Fu Hua Yu Qi Info Tech, Inc</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * This file porting from Linux kernel</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@file</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@author</span><span style="color: #ff4b4b;"> zhang jian ming</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@date</span><span style="color: #ff4b4b;"> 1/3/18</span>
<span style="color: #ff4b4b;"> */</span>

<span style="color: #d18aff;">#if</span><span style="color: #d18aff;">n</span><span style="color: #d18aff;">def</span> __FHOS_LIST_H__
<span style="color: #d18aff;">#define</span> <span style="color: #ff8700;">__FHOS_LIST_H__</span>


<span style="color: #d18aff;">#define</span> <span style="color: #ff8700;">LIST_POISON1</span>  ((<span style="color: #00d7af;">void</span> *) 0xdeadbeef)
<span style="color: #d18aff;">#define</span> <span style="color: #ff8700;">LIST_POISON2</span>  ((<span style="color: #00d7af;">void</span> *) 0xbaadf00d)

<span style="color: #d18aff;">#if</span><span style="color: #d18aff;">n</span><span style="color: #d18aff;">def</span> offsetof
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">offsetof</span>(<span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>) ((<span style="color: #00d7af;">size_t</span>) &amp;((<span style="color: #00d7af;">type</span> *)0)-&gt;member)
<span style="color: #d18aff;">#endif</span>

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * container_of - cast a member of a structure out to the containing structure</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@ptr</span><span style="color: #ff4b4b;">:    the pointer to the member.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@type</span><span style="color: #ff4b4b;">:   the type of the container struct this is embedded in.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the member within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">container_of</span>(<span style="color: #ff8700;">ptr</span>, <span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>) ({                  \
    <span style="color: #a1db00;">const</span> <span style="color: #a1db00;">typeof</span>( ((<span style="color: #00d7af;">type</span> *)0)-&gt;member ) *<span style="color: #ff8700;">__mptr</span> = (ptr);    \
    (<span style="color: #00d7af;">type</span> *)( (<span style="color: #00d7af;">char</span> *)__mptr - offsetof(type,member) );})


<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> {
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">next</span>, *<span style="color: #ff8700;">prev</span>;
};

<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_head</span> {
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">first</span>;
};

<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> {
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">next</span>, **<span style="color: #ff8700;">pprev</span>;
};


<span style="color: #6c6c6c; font-style: italic;">/*</span>
<span style="color: #6c6c6c; font-style: italic;"> * Simple doubly linked list implementation.</span>
<span style="color: #6c6c6c; font-style: italic;"> *</span>
<span style="color: #6c6c6c; font-style: italic;"> * Some of the internal functions ("__xxx") are useful when</span>
<span style="color: #6c6c6c; font-style: italic;"> * manipulating whole lists rather than single entries, as</span>
<span style="color: #6c6c6c; font-style: italic;"> * sometimes we already know the next/prev entries and we can</span>
<span style="color: #6c6c6c; font-style: italic;"> * generate better code by using them directly rather than</span>
<span style="color: #6c6c6c; font-style: italic;"> * using the generic single-entry routines.</span>
<span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">LIST_HEAD_INIT</span>(<span style="color: #ff8700;">name</span>) { &amp;(name), &amp;(name) }

<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">LIST_HEAD</span>(<span style="color: #ff8700;">name</span>) \
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> <span style="color: #ff8700;">name</span> = LIST_HEAD_INIT(name)

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">INIT_LIST_HEAD</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>)
{
    list-&gt;next = list;
    list-&gt;prev = list;
}

<span style="color: #6c6c6c; font-style: italic;">/*</span>
<span style="color: #6c6c6c; font-style: italic;"> * Insert a new entry between two known consecutive entries.</span>
<span style="color: #6c6c6c; font-style: italic;"> *</span>
<span style="color: #6c6c6c; font-style: italic;"> * This is only for internal list manipulation where we know</span>
<span style="color: #6c6c6c; font-style: italic;"> * the prev/next entries already!</span>
<span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #d18aff;">#if</span><span style="color: #d18aff;">n</span><span style="color: #d18aff;">def</span> CONFIG_DEBUG_LIST
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__list_add</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">new</span>,
                              <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">prev</span>,
                              <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">next</span>)
{
    next-&gt;prev = new;
    new-&gt;next = next;
    new-&gt;prev = prev;
    prev-&gt;next = new;
}
<span style="color: #d18aff;">#else</span>
<span style="color: #a1db00;">extern</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__list_add</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">new</span>,
                       <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">prev</span>,
                       <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">next</span>);
<span style="color: #d18aff;">#endif</span>

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_add - add a new entry</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@new</span><span style="color: #ff4b4b;">: new entry to be added</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: list head to add it after</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Insert a new entry after the specified head.</span>
<span style="color: #ff4b4b;"> * This is good for implementing stacks.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_add</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">new</span>, <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    __list_add(new, head, head-&gt;next);
}


<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_add_tail - add a new entry</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@new</span><span style="color: #ff4b4b;">: new entry to be added</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: list head to add it before</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Insert a new entry before the specified head.</span>
<span style="color: #ff4b4b;"> * This is useful for implementing queues.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_add_tail</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">new</span>, <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    __list_add(new, head-&gt;prev, head);
}

<span style="color: #6c6c6c; font-style: italic;">/*</span>
<span style="color: #6c6c6c; font-style: italic;"> * Delete a list entry by making the prev/next entries</span>
<span style="color: #6c6c6c; font-style: italic;"> * point to each other.</span>
<span style="color: #6c6c6c; font-style: italic;"> *</span>
<span style="color: #6c6c6c; font-style: italic;"> * This is only for internal list manipulation where we know</span>
<span style="color: #6c6c6c; font-style: italic;"> * the prev/next entries already!</span>
<span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__list_del</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> * <span style="color: #ff8700;">prev</span>, <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> * <span style="color: #ff8700;">next</span>)
{
    next-&gt;prev = prev;
    prev-&gt;next = next;
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_del - deletes entry from list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@entry</span><span style="color: #ff4b4b;">: the element to delete from the list.</span>
<span style="color: #ff4b4b;"> * Note: </span><span style="color: #5fafd7;">list_empty()</span><span style="color: #ff4b4b;"> on entry does not return true after this, the entry is</span>
<span style="color: #ff4b4b;"> * in an undefined state.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#if</span><span style="color: #d18aff;">n</span><span style="color: #d18aff;">def</span> CONFIG_DEBUG_LIST
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__list_del_entry</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">entry</span>)
{
    __list_del(entry-&gt;prev, entry-&gt;next);
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_del</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">entry</span>)
{
    __list_del(entry-&gt;prev, entry-&gt;next);
    entry-&gt;next = LIST_POISON1;
    entry-&gt;prev = LIST_POISON2;
}
<span style="color: #d18aff;">#else</span>
<span style="color: #a1db00;">extern</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__list_del_entry</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">entry</span>);
<span style="color: #a1db00;">extern</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_del</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">entry</span>);
<span style="color: #d18aff;">#endif</span>

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_replace - replace old entry by new one</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@old</span><span style="color: #ff4b4b;"> : the element to be replaced</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@new</span><span style="color: #ff4b4b;"> : the new element to insert</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * If </span><span style="color: #5fafd7;">@old</span><span style="color: #ff4b4b;"> was empty, it will be overwritten.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_replace</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">old</span>,
                                <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">new</span>)
{
    new-&gt;next = old-&gt;next;
    new-&gt;next-&gt;prev = new;
    new-&gt;prev = old-&gt;prev;
    new-&gt;prev-&gt;next = new;
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_replace_init</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">old</span>,
                                     <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">new</span>)
{
    list_replace(old, new);
    INIT_LIST_HEAD(old);
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_del_init - deletes entry from list and reinitialize it.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@entry</span><span style="color: #ff4b4b;">: the element to delete from the list.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_del_init</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">entry</span>)
{
    __list_del_entry(entry);
    INIT_LIST_HEAD(entry);
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_move - delete from one list and add as another's head</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: the entry to move</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the head that will precede our entry</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_move</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>, <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    __list_del_entry(list);
    list_add(list, head);
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_move_tail - delete from one list and add as another's tail</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: the entry to move</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the head that will follow our entry</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_move_tail</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                  <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    __list_del_entry(list);
    list_add_tail(list, head);
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_is_last - tests whether </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;"> is the last entry in list </span><span style="color: #5fafd7;">@head</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: the entry to test</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the head of the list</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">list_is_last</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                               <span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">return</span> list-&gt;next == head;
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_empty - tests whether a list is empty</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the list to test.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">list_empty</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">return</span> head-&gt;next == head;
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_empty_careful - tests whether a list is empty and not being modified</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the list to test</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">Description</span><span style="color: #ff4b4b;">:</span>
<span style="color: #ff4b4b;"> * tests whether a list is empty _and_ checks that no other CPU might be</span>
<span style="color: #ff4b4b;"> * in the process of modifying either member (next or prev)</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * NOTE: using </span><span style="color: #5fafd7;">list_empty_careful()</span><span style="color: #ff4b4b;"> without synchronization</span>
<span style="color: #ff4b4b;"> * can only be safe if the only activity that can happen</span>
<span style="color: #ff4b4b;"> * to the list entry is </span><span style="color: #5fafd7;">list_del_init()</span><span style="color: #ff4b4b;">. Eg. it cannot be used</span>
<span style="color: #ff4b4b;"> * if another CPU could re-</span><span style="color: #5fafd7;">list_add()</span><span style="color: #ff4b4b;"> it.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">list_empty_careful</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">next</span> = head-&gt;next;
    <span style="color: #a1db00;">return</span> (next == head) &amp;&amp; (next == head-&gt;prev);
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_rotate_left - rotate the list to the left</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the head of the list</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_rotate_left</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">first</span>;

    <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>list_empty(head)) {
        first = head-&gt;next;
        list_move_tail(first, head);
    }
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_is_singular - tests whether a list has just one entry.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the list to test.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">list_is_singular</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">return</span> <span style="color: #ff4b4b;">!</span>list_empty(head) &amp;&amp; (head-&gt;next == head-&gt;prev);
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__list_cut_position</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                                       <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>,
                                       <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">entry</span>)
{
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">new_first</span> = entry-&gt;next;
    list-&gt;next = head-&gt;next;
    list-&gt;next-&gt;prev = list;
    list-&gt;prev = entry;
    entry-&gt;next = list;
    head-&gt;next = new_first;
    new_first-&gt;prev = head;
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_cut_position - cut a list into two</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: a new list to add all removed entries</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: a list with entries</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@entry</span><span style="color: #ff4b4b;">: an entry within head, could be the head itself</span>
<span style="color: #ff4b4b;"> *  and if so we won't cut the list</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * This helper moves the initial part of </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">, up to and</span>
<span style="color: #ff4b4b;"> * including </span><span style="color: #5fafd7;">@entry</span><span style="color: #ff4b4b;">, from </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;"> to </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">. You should</span>
<span style="color: #ff4b4b;"> * pass on </span><span style="color: #5fafd7;">@entry</span><span style="color: #ff4b4b;"> an element you know is on </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">. </span><span style="color: #5fafd7;">@list</span>
<span style="color: #ff4b4b;"> * should be an empty list or a list you do not care about</span>
<span style="color: #ff4b4b;"> * losing its data.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_cut_position</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                                     <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>,
                                     <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">entry</span>)
{
    <span style="color: #a1db00;">if</span> (list_empty(head))
        <span style="color: #a1db00;">return</span>;
    <span style="color: #a1db00;">if</span> (list_is_singular(head) &amp;&amp;
        (head-&gt;next != entry &amp;&amp; head != entry))
        <span style="color: #a1db00;">return</span>;
    <span style="color: #a1db00;">if</span> (entry == head)
        INIT_LIST_HEAD(list);
    <span style="color: #a1db00;">else</span>
        __list_cut_position(list, head, entry);
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__list_splice</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                                 <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">prev</span>,
                                 <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">next</span>)
{
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">first</span> = list-&gt;next;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">last</span> = list-&gt;prev;

    first-&gt;prev = prev;
    prev-&gt;next = first;

    last-&gt;next = next;
    next-&gt;prev = last;
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_splice - join two lists, this is designed for stacks</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: the new list to add.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the place to add it in the first list.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_splice</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                               <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>list_empty(list))
        __list_splice(list, head, head-&gt;next);
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_splice_tail - join two lists, each list being a queue</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: the new list to add.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the place to add it in the first list.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_splice_tail</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                                    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>list_empty(list))
        __list_splice(list, head-&gt;prev, head);
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_splice_init - join two lists and reinitialise the emptied list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: the new list to add.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the place to add it in the first list.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * The list at </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;"> is reinitialised</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_splice_init</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                                    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>list_empty(list)) {
        __list_splice(list, head, head-&gt;next);
        INIT_LIST_HEAD(list);
    }
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_splice_tail_init - join two lists and reinitialise the emptied list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;">: the new list to add.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">: the place to add it in the first list.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Each of the lists is a queue.</span>
<span style="color: #ff4b4b;"> * The list at </span><span style="color: #5fafd7;">@list</span><span style="color: #ff4b4b;"> is reinitialised</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">list_splice_tail_init</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">list</span>,
                                         <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">head</span>)
{
    <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>list_empty(list)) {
        __list_splice(list, head-&gt;prev, head);
        INIT_LIST_HEAD(list);
    }
}

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_entry - get the struct for this entry</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@ptr</span><span style="color: #ff4b4b;">:    the &amp;struct list_head pointer.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@type</span><span style="color: #ff4b4b;">:   the type of the struct this is embedded in.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_entry</span>(<span style="color: #ff8700;">ptr</span>, <span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>) \
    container_of(ptr, type, member)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_first_entry - get the first element from a list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@ptr</span><span style="color: #ff4b4b;">:    the list head to take the element from.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@type</span><span style="color: #ff4b4b;">:   the type of the struct this is embedded in.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Note, that list is expected to be not empty.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_first_entry</span>(<span style="color: #ff8700;">ptr</span>, <span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>) \
    list_entry((ptr)-&gt;next, type, member)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_last_entry - get the last element from a list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@ptr</span><span style="color: #ff4b4b;">:    the list head to take the element from.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@type</span><span style="color: #ff4b4b;">:   the type of the struct this is embedded in.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Note, that list is expected to be not empty.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_last_entry</span>(<span style="color: #ff8700;">ptr</span>, <span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>) \
    list_entry((ptr)-&gt;prev, type, member)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_first_entry_or_null - get the first element from a list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@ptr</span><span style="color: #ff4b4b;">:    the list head to take the element from.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@type</span><span style="color: #ff4b4b;">:   the type of the struct this is embedded in.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Note that if the list is empty, it returns NULL.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_first_entry_or_null</span>(<span style="color: #ff8700;">ptr</span>, <span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>) \
    (<span style="color: #ff4b4b;">!</span>list_empty(ptr) ? list_first_entry(ptr, type, member) : <span style="color: #5fafd7;">NULL</span>)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_next_entry - get the next element in list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to cursor</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_next_entry</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">member</span>) \
    list_entry((pos)-&gt;member.next, <span style="color: #a1db00;">typeof</span>(*(pos)), member)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_prev_entry - get the prev element in list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to cursor</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_prev_entry</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">member</span>) \
    list_entry((pos)-&gt;member.prev, <span style="color: #a1db00;">typeof</span>(*(pos)), member)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each    -   iterate over a list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the &amp;struct list_head to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>) \
    <span style="color: #a1db00;">for</span> (pos = (head)-&gt;next; pos != (head); pos = pos-&gt;next)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_prev   -   iterate over a list backwards</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the &amp;struct list_head to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_prev</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>) \
    <span style="color: #a1db00;">for</span> (pos = (head)-&gt;prev; pos != (head); pos = pos-&gt;prev)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_safe - iterate over a list safe against removal of list entry</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the &amp;struct list_head to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      another &amp;struct list_head to use as temporary storage</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_safe</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>)                   \
    <span style="color: #a1db00;">for</span> (pos = (head)-&gt;next, n = pos-&gt;next; pos != (head); \
        pos = n, n = pos-&gt;next)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_prev_safe - iterate over a list backwards safe against removal of list entry</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the &amp;struct list_head to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      another &amp;struct list_head to use as temporary storage</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_prev_safe</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>) \
    <span style="color: #a1db00;">for</span> (pos = (head)-&gt;prev, n = pos-&gt;prev;   \
         pos != (head);                       \
         pos = n, n = pos-&gt;prev)

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry  -   iterate over list of given type</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>)               \
    <span style="color: #a1db00;">for</span> (pos = list_first_entry(head, <span style="color: #a1db00;">typeof</span>(*pos), member); \
         &amp;pos-&gt;member != (head);                             \
         pos = list_next_entry(pos, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_reverse - iterate backwards over list of given type.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_reverse</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>)      \
    <span style="color: #a1db00;">for</span> (pos = list_last_entry(head, <span style="color: #a1db00;">typeof</span>(*pos), member); \
         &amp;pos-&gt;member != (head);                            \
         pos = list_prev_entry(pos, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_prepare_entry - prepare a pos entry for use in </span><span style="color: #5fafd7;">list_for_each_entry_continue()</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a start point</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head of the list</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Prepares a pos entry for use as a start point in </span><span style="color: #5fafd7;">list_for_each_entry_continue()</span><span style="color: #ff4b4b;">.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_prepare_entry</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>) \
    ((pos) ? : list_entry(head, <span style="color: #a1db00;">typeof</span>(*pos), member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_continue - continue iteration over list of given type</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Continue to iterate over list of given type, continuing after</span>
<span style="color: #ff4b4b;"> * the current position.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_continue</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>) \
    <span style="color: #a1db00;">for</span> (pos = list_next_entry(pos, member);            \
         &amp;pos-&gt;member != (head);                        \
         pos = list_next_entry(pos, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_continue_reverse - iterate backwards from the given point</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Start to iterate over list of given type backwards, continuing after</span>
<span style="color: #ff4b4b;"> * the current position.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_continue_reverse</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>) \
    <span style="color: #a1db00;">for</span> (pos = list_prev_entry(pos, member);                    \
         &amp;pos-&gt;member != (head);                                \
         pos = list_prev_entry(pos, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_from - iterate over list of given type from the current point</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Iterate over list of given type, continuing from current position.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_from</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>) \
    <span style="color: #a1db00;">for</span> (; &amp;pos-&gt;member != (head);                  \
         pos = list_next_entry(pos, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_safe - iterate over list of given type safe against removal of list entry</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      another type * to use as temporary storage</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_safe</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>)          \
    <span style="color: #a1db00;">for</span> (pos = list_first_entry(head, <span style="color: #a1db00;">typeof</span>(*pos), member),    \
         n = list_next_entry(pos, member);                      \
         &amp;pos-&gt;member != (head);                                \
         pos = n, n = list_next_entry(n, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_safe_continue - continue list iteration safe against removal</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      another type * to use as temporary storage</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Iterate over list of given type, continuing after current point,</span>
<span style="color: #ff4b4b;"> * safe against removal of list entry.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_safe_continue</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>) \
    <span style="color: #a1db00;">for</span> (pos = list_next_entry(pos, member),                    \
         n = list_next_entry(pos, member);                      \
         &amp;pos-&gt;member != (head);                                \
         pos = n, n = list_next_entry(n, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_safe_from - iterate over list from current point safe against removal</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      another type * to use as temporary storage</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Iterate over list of given type from current point, safe against</span>
<span style="color: #ff4b4b;"> * removal of list entry.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_safe_from</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>) \
    <span style="color: #a1db00;">for</span> (n = list_next_entry(pos, member);                  \
         &amp;pos-&gt;member != (head);                            \
         pos = n, n = list_next_entry(n, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_for_each_entry_safe_reverse - iterate backwards over list safe against removal</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      another type * to use as temporary storage</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * Iterate backwards over list of given type, safe against removal</span>
<span style="color: #ff4b4b;"> * of list entry.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_for_each_entry_safe_reverse</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>)  \
    <span style="color: #a1db00;">for</span> (pos = list_last_entry(head, <span style="color: #a1db00;">typeof</span>(*pos), member),     \
         n = list_prev_entry(pos, member);                      \
         &amp;pos-&gt;member != (head);                                \
         pos = n, n = list_prev_entry(n, member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * list_safe_reset_next - reset a stale list_for_each_entry_safe loop</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the loop cursor used in the list_for_each_entry_safe loop</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      temporary storage used in list_for_each_entry_safe</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the list_head within the struct.</span>
<span style="color: #ff4b4b;"> *</span>
<span style="color: #ff4b4b;"> * list_safe_reset_next is not safe to use in general if the list may be</span>
<span style="color: #ff4b4b;"> * modified concurrently (eg. the lock is dropped in the loop body). An</span>
<span style="color: #ff4b4b;"> * exception to this is if the cursor element (pos) is pinned in the list,</span>
<span style="color: #ff4b4b;"> * and list_safe_reset_next is called after re-taking the lock and before</span>
<span style="color: #ff4b4b;"> * completing the current iteration of the loop body.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">list_safe_reset_next</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">member</span>)    \
    n = list_next_entry(pos, member)

<span style="color: #6c6c6c; font-style: italic;">/*</span>
<span style="color: #6c6c6c; font-style: italic;"> * Double linked lists with a single pointer list head.</span>
<span style="color: #6c6c6c; font-style: italic;"> * Mostly useful for hash tables where the two pointer list head is</span>
<span style="color: #6c6c6c; font-style: italic;"> * too wasteful.</span>
<span style="color: #6c6c6c; font-style: italic;"> * You lose the ability to access the tail in O(1).</span>
<span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

<span style="color: #d18aff;">#define</span> <span style="color: #ff8700;">HLIST_HEAD_INIT</span> { .first = <span style="color: #5fafd7;">NULL</span> }
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">HLIST_HEAD</span>(<span style="color: #ff8700;">name</span>) <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_head</span> <span style="color: #ff8700;">name</span> = {  .first = <span style="color: #5fafd7;">NULL</span> }
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">INIT_HLIST_HEAD</span>(<span style="color: #ff8700;">ptr</span>) ((ptr)-&gt;first = <span style="color: #5fafd7;">NULL</span>)
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">INIT_HLIST_NODE</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">h</span>)
{
    h-&gt;next = <span style="color: #5fafd7;">NULL</span>;
    h-&gt;pprev = <span style="color: #5fafd7;">NULL</span>;
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">hlist_unhashed</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">h</span>)
{
    <span style="color: #a1db00;">return</span> <span style="color: #ff4b4b;">!</span>h-&gt;pprev;
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">hlist_empty</span>(<span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_head</span> *<span style="color: #ff8700;">h</span>)
{
    <span style="color: #a1db00;">return</span> <span style="color: #ff4b4b;">!</span>h-&gt;first;
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">__hlist_del</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">n</span>)
{
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">next</span> = n-&gt;next;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> **<span style="color: #ff8700;">pprev</span> = n-&gt;pprev;
    *pprev = next;
    <span style="color: #a1db00;">if</span> (next)
        next-&gt;pprev = pprev;
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">hlist_del</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">n</span>)
{
    __hlist_del(n);
    n-&gt;next = LIST_POISON1;
    n-&gt;pprev = LIST_POISON2;
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">hlist_del_init</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">n</span>)
{
    <span style="color: #a1db00;">if</span> (<span style="color: #ff4b4b;">!</span>hlist_unhashed(n)) {
        __hlist_del(n);
        INIT_HLIST_NODE(n);
    }
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">hlist_add_head</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">n</span>, <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_head</span> *<span style="color: #ff8700;">h</span>)
{
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">first</span> = h-&gt;first;
    n-&gt;next = first;
    <span style="color: #a1db00;">if</span> (first)
        first-&gt;pprev = &amp;n-&gt;next;
    h-&gt;first = n;
    n-&gt;pprev = &amp;h-&gt;first;
}

<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">next must be != NULL </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">hlist_add_before</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">n</span>,
                                    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">next</span>)
{
    n-&gt;pprev = next-&gt;pprev;
    n-&gt;next = next;
    next-&gt;pprev = &amp;n-&gt;next;
    *(n-&gt;pprev) = n;
}

<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">hlist_add_behind</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">n</span>,
                                    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">prev</span>)
{
    n-&gt;next = prev-&gt;next;
    prev-&gt;next = n;
    n-&gt;pprev = &amp;prev-&gt;next;

    <span style="color: #a1db00;">if</span> (n-&gt;next)
        n-&gt;next-&gt;pprev  = &amp;n-&gt;next;
}

<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">after that we'll appear to be on some hlist and hlist_del will work </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">hlist_add_fake</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_node</span> *<span style="color: #ff8700;">n</span>)
{
    n-&gt;pprev = &amp;n-&gt;next;
}

<span style="color: #6c6c6c; font-style: italic;">/*</span>
<span style="color: #6c6c6c; font-style: italic;"> * Move a list from one list head to another. Fixup the pprev</span>
<span style="color: #6c6c6c; font-style: italic;"> * reference of the first entry if it exists.</span>
<span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #a1db00;">static</span> <span style="color: #a1db00;">inline</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">hlist_move_list</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_head</span> *<span style="color: #ff8700;">old</span>,
                                   <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">hlist_head</span> *<span style="color: #ff8700;">new</span>)
{
    new-&gt;first = old-&gt;first;
    <span style="color: #a1db00;">if</span> (new-&gt;first)
        new-&gt;first-&gt;pprev = &amp;new-&gt;first;
    old-&gt;first = <span style="color: #5fafd7;">NULL</span>;
}

<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_entry</span>(<span style="color: #ff8700;">ptr</span>, <span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>) container_of(ptr,type,member)

<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_for_each</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>) \
    <span style="color: #a1db00;">for</span> (pos = (head)-&gt;first; pos ; pos = pos-&gt;next)

<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_for_each_safe</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>)                    \
    <span style="color: #a1db00;">for</span> (pos = (head)-&gt;first; pos &amp;&amp; ({ n = pos-&gt;next; 1; });\
         pos = n)

<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_entry_safe</span>(<span style="color: #ff8700;">ptr</span>, <span style="color: #ff8700;">type</span>, <span style="color: #ff8700;">member</span>)                 \
    ({ <span style="color: #a1db00;">typeof</span>(ptr) <span style="color: #ff8700;">____ptr</span> = (ptr);                         \
        ____ptr ? hlist_entry(____ptr, type, member) : <span style="color: #5fafd7;">NULL</span>;\
    })

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * hlist_for_each_entry - iterate over list of given type</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the hlist_node within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_for_each_entry</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>)                        \
    <span style="color: #a1db00;">for</span> (pos = hlist_entry_safe((head)-&gt;first, <span style="color: #a1db00;">typeof</span>(*(pos)), member);\
         pos;                                                          \
         pos = hlist_entry_safe((pos)-&gt;member.next, <span style="color: #a1db00;">typeof</span>(*(pos)), member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * hlist_for_each_entry_continue - iterate over a hlist continuing after current point</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the hlist_node within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_for_each_entry_continue</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">member</span>)                          \
    <span style="color: #a1db00;">for</span> (pos = hlist_entry_safe((pos)-&gt;member.next, <span style="color: #a1db00;">typeof</span>(*(pos)), member);\
         pos;                                                               \
         pos = hlist_entry_safe((pos)-&gt;member.next, <span style="color: #a1db00;">typeof</span>(*(pos)), member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * hlist_for_each_entry_from - iterate over a hlist continuing from current point</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the hlist_node within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_for_each_entry_from</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">member</span>)              \
    <span style="color: #a1db00;">for</span> (; pos;                                             \
         pos = hlist_entry_safe((pos)-&gt;member.next, <span style="color: #a1db00;">typeof</span>(*(pos)), member))

<span style="color: #ff4b4b;">/**</span>
<span style="color: #ff4b4b;"> * hlist_for_each_entry_safe - iterate over list of given type safe against removal of list entry</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@pos</span><span style="color: #ff4b4b;">:    the type * to use as a loop cursor.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@n</span><span style="color: #ff4b4b;">:      another &amp;struct hlist_node to use as temporary storage</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@head</span><span style="color: #ff4b4b;">:   the head for your list.</span>
<span style="color: #ff4b4b;"> * </span><span style="color: #5fafd7;">@member</span><span style="color: #ff4b4b;">: the name of the hlist_node within the struct.</span>
<span style="color: #ff4b4b;"> */</span>
<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">hlist_for_each_entry_safe</span>(<span style="color: #ff8700;">pos</span>, <span style="color: #ff8700;">n</span>, <span style="color: #ff8700;">head</span>, <span style="color: #ff8700;">member</span>)              \
    <span style="color: #a1db00;">for</span> (pos = hlist_entry_safe((head)-&gt;first, <span style="color: #a1db00;">typeof</span>(*pos), member);\
         pos &amp;&amp; ({ n = pos-&gt;member.next; 1; });                      \
         pos = hlist_entry_safe(n, <span style="color: #a1db00;">typeof</span>(*pos), member))

<span style="color: #d18aff;">#endif</span>
   
</pre>
</div>
</div>
</div>
