archive/before-2018-11-10/source/2018-01-15-linux内核中的数据结构.org
** main
   :PROPERTIES:
   :header-args: :tangle /tmp/kernel_data_structure/list/main.c :main no :mkdirp yes
   :END:

   头文件：
   #+BEGIN_SRC C
#include <stdio.h>
#include <stdlib.h>
#include "list.h"
   #+END_SRC

   内核中不是把结构串成一个链。而是在结构中嵌入一个链表。
   #+BEGIN_EXAMPLE
The common pattern for storing this structure in a linked list is to
embed the list pointer in the structure. For example, to describe
that member of the Canidae family:

struct fox {
    unsigned long tail_length; /* length in centimeters of tail */
    unsigned long weight; /* weight in kilograms */
    bool is_fantastic; /* is this fox fantastic? */
    struct fox *next; /* next fox in linked list */
    struct fox *prev; /* previous fox in linked list */
};

The Linux kernel approach is different. Instead of turning the
structure into a linked list, the Linux approach is to "embed a
linked list node in the structure".

The Linked List Structure¶

The linked-list code is declared in the header file <linux/list.h> (
include/linux/list.h#L19) and the data structure is simple:

struct list_head {
    struct list_head *next
    struct list_head *prev;
};

The utility is in how the list_head structure is used:

struct fox {
    unsigned long tail_length; /* length in centimeters of tail */
    unsigned long weight; /* weight in kilograms */
    bool is_fantastic; /* is this fox fantastic? */
    struct list_head list; /* list of all fox structures */
};

With this, list.next in fox points to the next element, and list.prev
in fox points to the previous.
   #+END_EXAMPLE

   把结构串定义的结构体中需要加一个 =list_head= 成员，其实查看代码就知
   道，是通过这个成员的偏移来查找的结构体的首指针：
   #+BEGIN_SRC C
typedef struct test_node_s
{
    int a;
    int b;
    struct list_head list_t;
} test_node_t;
   #+END_SRC
   
   使用时需要先声明一个链表头：
   #+BEGIN_SRC C
static LIST_HEAD(test_list);
   #+END_SRC
   
   声明一些我自定义的函数：
   #+BEGIN_SRC C
int add(int a, int b);
int loop();
int del();
   #+END_SRC

   向链表中添加成员：
   #+BEGIN_SRC C
int add(int a, int b)
{
    test_node_t *t1 = (test_node_t *)malloc(sizeof(test_node_t));

    t1->a = a;
    t1->b = b;
    INIT_LIST_HEAD(&(t1->list_t));

    list_add(&t1->list_t, &test_list);

    return 0;
}
   #+END_SRC
   
   从链表中删除成员，需要注意的是，把成员从链表中的删除后，成员对应的
   空间是没有被释放的，需要使用者自己释放：
   #+BEGIN_SRC C
int del()
{
    test_node_t *t1 = (test_node_t *)malloc(sizeof(test_node_t));

    t1->a = 30;
    t1->b = 40;
    INIT_LIST_HEAD(&(t1->list_t));

    list_add(&t1->list_t, &test_list);

    loop();

    list_del(&t1->list_t);

    loop();

    return 0;
}
   #+END_SRC

   遍历整个链表：
   #+BEGIN_SRC C
int loop()
{
    printf("========================== Loop ======================\n");
    test_node_t *pointer;

    list_for_each_entry(pointer, &test_list, list_t)
    {
        printf("in loop--------> a= %d\n", pointer->a);
    }
    
    return 0;
}
   #+END_SRC
   
   main函数来调用：
   #+BEGIN_SRC C
int main(int args,char *argv[])
{

    add(1, 2);

    add(3, 4);

    loop();

    del();

    return 0;
}
   #+END_SRC
** Makefile
   #+BEGIN_SRC makefile :tangle /tmp/kernel_data_structure/list/Makefile :mkdirp yes 
all: list

list:main.c
	cc -o list main.c
	cc -o example example.c

clean:
	rm -rfv *.o list a.out
   #+END_SRC
