archive/before-2018-11-10/2018-01-15-linux内核中的数据结构.html
<div id="outline-container-org3403d27" class="outline-3">
<h3 id="org3403d27"><span class="section-number-3">1.2</span> main</h3>
<div class="outline-text-3" id="text-1-2">
<p>
头文件：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">"list.h"</span>
</pre>
</div>

<p>
内核中不是把结构串成一个链。而是在结构中嵌入一个链表。
</p>
<pre class="example">
The common pattern for storing this structure in a linked list is to
embed the list pointer in the structure. For example, to describe
that member of the Canidae family:

struct fox {
    unsigned long tail_length; /* length in centimeters of tail */
    unsigned long weight; /* weight in kilograms */
    bool is_fantastic; /* is this fox fantastic? */
    struct fox *next; /* next fox in linked list */
    struct fox *prev; /* previous fox in linked list */
};

The Linux kernel approach is different. Instead of turning the
structure into a linked list, the Linux approach is to "embed a
linked list node in the structure".

The Linked List Structure¶

The linked-list code is declared in the header file &lt;linux/list.h&gt; (
include/linux/list.h#L19) and the data structure is simple:

struct list_head {
    struct list_head *next
    struct list_head *prev;
};

The utility is in how the list_head structure is used:

struct fox {
    unsigned long tail_length; /* length in centimeters of tail */
    unsigned long weight; /* weight in kilograms */
    bool is_fantastic; /* is this fox fantastic? */
    struct list_head list; /* list of all fox structures */
};

With this, list.next in fox points to the next element, and list.prev
in fox points to the previous.
</pre>

<p>
把结构串定义的结构体中需要加一个 <code>list_head</code> 成员，其实查看代码就知
道，是通过这个成员的偏移来查找的结构体的首指针：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #a1db00;">typedef</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">test_node_s</span>
{
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">a</span>;
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">b</span>;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> <span style="color: #ff8700;">list_t</span>;
} <span style="color: #00d7af;">test_node_t</span>;
</pre>
</div>

<p>
使用时需要先声明一个链表头：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #a1db00;">static</span> <span style="color: #ffd700;">LIST_HEAD</span>(test_list);
</pre>
</div>

<p>
声明一些我自定义的函数：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">add</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">a</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">b</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">loop</span>();
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">del</span>();
</pre>
</div>

<p>
向链表中添加成员：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">add</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">a</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">b</span>)
{
    <span style="color: #00d7af;">test_node_t</span> *<span style="color: #ff8700;">t1</span> = (<span style="color: #00d7af;">test_node_t</span> *)malloc(<span style="color: #a1db00;">sizeof</span>(test_node_t));

    t1-&gt;a = a;
    t1-&gt;b = b;
    INIT_LIST_HEAD(&amp;(t1-&gt;list_t));

    list_add(&amp;t1-&gt;list_t, &amp;test_list);

    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<p>
从链表中删除成员，需要注意的是，把成员从链表中的删除后，成员对应的
空间是没有被释放的，需要使用者自己释放：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">del</span>()
{
    <span style="color: #00d7af;">test_node_t</span> *<span style="color: #ff8700;">t1</span> = (<span style="color: #00d7af;">test_node_t</span> *)malloc(<span style="color: #a1db00;">sizeof</span>(test_node_t));

    t1-&gt;a = 30;
    t1-&gt;b = 40;
    INIT_LIST_HEAD(&amp;(t1-&gt;list_t));

    list_add(&amp;t1-&gt;list_t, &amp;test_list);

    loop();

    list_del(&amp;t1-&gt;list_t);

    loop();

    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<p>
遍历整个链表：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">loop</span>()
{
    printf(<span style="color: #ff4ea3;">"========================== Loop ======================\n"</span>);
    <span style="color: #00d7af;">test_node_t</span> *<span style="color: #ff8700;">pointer</span>;

    list_for_each_entry(pointer, &amp;test_list, list_t)
    {
        printf(<span style="color: #ff4ea3;">"in loop--------&gt; a= %d\n"</span>, pointer-&gt;a);
    }
    
    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<p>
main函数来调用：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">args</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{

    add(1, 2);

    add(3, 4);

    loop();

    del();

    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org026d702" class="outline-3">
<h3 id="org026d702"><span class="section-number-3">1.3</span> Makefile</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #ffd700;">all</span>: list

<span style="color: #ffd700;">list</span>:main.c
        cc -o list main.c
        cc -o example example.c

<span style="color: #ffd700;">clean</span>:
        rm -rfv *.o list a.out
</pre>
</div>
</div>
</div>
