archive/before-2018-11-10/2018-01-15-linux内核中的数据结构.html
<div id="outline-container-orgb6ee252" class="outline-3">
<h3 id="orgb6ee252"><span class="section-number-3">1.4</span> more example</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>

<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">"list.h"</span>


<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">kool_list</span>
{
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">to</span>;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> <span style="color: #ff8700;">list</span>;
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">from</span>;
};

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> **<span style="color: #ff8700;">argv</span>)
{

    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">kool_list</span> *<span style="color: #ff8700;">tmp</span>;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">list_head</span> *<span style="color: #ff8700;">pos</span>, *<span style="color: #ff8700;">q</span>;
    <span style="color: #00d7af;">unsigned</span> <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span>;

    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">kool_list</span> <span style="color: #ff8700;">mylist</span>;
    INIT_LIST_HEAD(&amp;mylist.list);
    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">or you could have declared this with the following macro</span>
<span style="color: #6c6c6c; font-style: italic;">     * LIST_HEAD(mylist); which declares and initializes the list</span>
<span style="color: #6c6c6c; font-style: italic;">     </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">adding elements to mylist </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
    <span style="color: #a1db00;">for</span>(i=5; i!=0; --i)
    {
        tmp= (<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">kool_list</span> *)malloc(<span style="color: #a1db00;">sizeof</span>(<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">kool_list</span>));
        
        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">INIT_LIST_HEAD(&amp;tmp-&gt;list); </span>
<span style="color: #6c6c6c; font-style: italic;">         *</span>
<span style="color: #6c6c6c; font-style: italic;">         * this initializes a dynamically allocated list_head. we</span>
<span style="color: #6c6c6c; font-style: italic;">         * you can omit this if subsequent call is add_list() or </span>
<span style="color: #6c6c6c; font-style: italic;">         * anything along that line because the next, prev</span>
<span style="color: #6c6c6c; font-style: italic;">         * fields get initialized in those functions.</span>
<span style="color: #6c6c6c; font-style: italic;">         </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        printf(<span style="color: #ff4ea3;">"enter to and from:"</span>);
        scanf(<span style="color: #ff4ea3;">"%d %d"</span>, &amp;tmp-&gt;to, &amp;tmp-&gt;from);

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">add the new item 'tmp' to the list of items in mylist </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        list_add(&amp;(tmp-&gt;list), &amp;(mylist.list));
        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">you can also use list_add_tail() which adds new items to</span>
<span style="color: #6c6c6c; font-style: italic;">         * the tail end of the list</span>
<span style="color: #6c6c6c; font-style: italic;">         </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
    }
    printf(<span style="color: #ff4ea3;">"\n"</span>);


    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">now you have a circularly linked list of items of type struct kool_list.</span>
<span style="color: #6c6c6c; font-style: italic;">     * now let us go through the items and print them out</span>
<span style="color: #6c6c6c; font-style: italic;">     </span><span style="color: #6c6c6c; font-style: italic;">*/</span>


    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">list_for_each() is a macro for a for loop. </span>
<span style="color: #6c6c6c; font-style: italic;">     * first parameter is used as the counter in for loop. in other words, inside the</span>
<span style="color: #6c6c6c; font-style: italic;">     * loop it points to the current item's list_head.</span>
<span style="color: #6c6c6c; font-style: italic;">     * second parameter is the pointer to the list. it is not manipulated by the macro.</span>
<span style="color: #6c6c6c; font-style: italic;">     </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
    printf(<span style="color: #ff4ea3;">"traversing the list using list_for_each()\n"</span>);
    list_for_each(pos, &amp;mylist.list)
    {

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">at this point: pos-&gt;next points to the next item's 'list' variable and </span>
<span style="color: #6c6c6c; font-style: italic;">         * pos-&gt;prev points to the previous item's 'list' variable. Here item is </span>
<span style="color: #6c6c6c; font-style: italic;">         * of type struct kool_list. But we need to access the item itself not the </span>
<span style="color: #6c6c6c; font-style: italic;">         * variable 'list' in the item! macro list_entry() does just that. See "How</span>
<span style="color: #6c6c6c; font-style: italic;">         * does this work?" below for an explanation of how this is done.</span>
<span style="color: #6c6c6c; font-style: italic;">         </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
        tmp= list_entry(pos, <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">kool_list</span>, list);

        <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">given a pointer to struct list_head, type of data structure it is part of,</span>
<span style="color: #6c6c6c; font-style: italic;">         * and it's name (struct list_head's name in the data structure) it returns a</span>
<span style="color: #6c6c6c; font-style: italic;">         * pointer to the data structure in which the pointer is part of.</span>
<span style="color: #6c6c6c; font-style: italic;">         * For example, in the above line list_entry() will return a pointer to the</span>
<span style="color: #6c6c6c; font-style: italic;">         * struct kool_list item it is embedded in!</span>
<span style="color: #6c6c6c; font-style: italic;">         </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

        printf(<span style="color: #ff4ea3;">"to= %d from= %d\n"</span>, tmp-&gt;to, tmp-&gt;from);

    }

    printf(<span style="color: #ff4ea3;">"\n"</span>);
    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">since this is a circularly linked list. you can traverse the list in reverse order</span>
<span style="color: #6c6c6c; font-style: italic;">     * as well. all you need to do is replace 'list_for_each' with 'list_for_each_prev'</span>
<span style="color: #6c6c6c; font-style: italic;">     * everything else remain the same!</span>
<span style="color: #6c6c6c; font-style: italic;">     *</span>
<span style="color: #6c6c6c; font-style: italic;">     * Also you can traverse the list using list_for_each_entry() to iterate over a given</span>
<span style="color: #6c6c6c; font-style: italic;">     * type of entries. For example:</span>
<span style="color: #6c6c6c; font-style: italic;">     </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
    printf(<span style="color: #ff4ea3;">"traversing the list using list_for_each_entry()\n"</span>);
    list_for_each_entry(tmp, &amp;mylist.list, list)
        printf(<span style="color: #ff4ea3;">"to= %d from= %d\n"</span>, tmp-&gt;to, tmp-&gt;from);
    printf(<span style="color: #ff4ea3;">"\n"</span>);
    

    <span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">now let's be good and free the kool_list items. since we will be removing items</span>
<span style="color: #6c6c6c; font-style: italic;">     * off the list using list_del() we need to use a safer version of the list_for_each() </span>
<span style="color: #6c6c6c; font-style: italic;">     * macro aptly named list_for_each_safe(). Note that you MUST use this macro if the loop </span>
<span style="color: #6c6c6c; font-style: italic;">     * involves deletions of items (or moving items from one list to another).</span>
<span style="color: #6c6c6c; font-style: italic;">     </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
    printf(<span style="color: #ff4ea3;">"deleting the list using list_for_each_safe()\n"</span>);
    list_for_each_safe(pos, q, &amp;mylist.list)
    {
        tmp= list_entry(pos, <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">kool_list</span>, list);
        printf(<span style="color: #ff4ea3;">"freeing item to= %d from= %d\n"</span>, tmp-&gt;to, tmp-&gt;from);
        list_del(pos);
        free(tmp);
    }

    <span style="color: #a1db00;">return</span> 0;
}

  
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge7004f0" class="outline-2">
<h2 id="orge7004f0"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Queues</h2>
</div>
<div id="outline-container-org57eb882" class="outline-2">
<h2 id="org57eb882"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Maps</h2>
</div>
<div id="outline-container-org719db3c" class="outline-2">
<h2 id="org719db3c"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Binary trees</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>